# Pandas

--->The word pandas is an acronym which is derived from "Python and data analysis" and "panel data". Pandas is one of the most used libraries in python language. It is used for data manipulation(merge, join, concatenate and DataFrame) and analysis.

Pandas deals with the following three data structures âˆ’

Series        -   1D labeled homogeneous array.
DataFrame     -   General 2D labeled, size-mutable tabular structure with potentially heterogeneously typed columns.
Panel         -   General 3D labeled, size-mutable array.

In [1]:
# Import pandas 
import pandas as pd

In [4]:
s=[1,2,3,4]
a=pd.Series(s)      # pd.Series 'S' must be capital
print(a)

0    1
1    2
2    3
3    4
dtype: int64

In [5]:
# Check the type
type(a)

pandas.core.series.Series

In [7]:
# Change the index name 
index_name= pd.Series([1,2,3,4], index=['a', 'b','c','d'])
index_name

a    1
b    2
c    3
d    4
dtype: int64

### DataFrame

#### DataFrame is a 2-dimensional labeled data structure with columns of potentially different types.

In [9]:
# Create DataFrame
a= [1,2,3,4]
data_frame=pd.DataFrame(a)
data_frame

   0
0  1
1  2
2  3
3  4

In [12]:
# Change the index name
data_frame=pd.DataFrame(a, index=['a', 'b', 'c', 'd'])
data_frame

   0
a  1
b  2
c  3
d  4

In [16]:
# DataFrame using Dictionary
df={'Games': ['Cricket', 'Soccer', 'Tennis'], 'Score':['240-3', '3-3', '10-20-36']}
df=pd.DataFrame(df)
print(df)

     Games     Score
0  Cricket     240-3
1   Soccer       3-3
2   Tennis  10-20-36

In [42]:
import pandas as pd
data = [['Honey',20],['Bunny',21],['Sunny',22]]
df = pd.DataFrame(data,columns=['Name','Age'], index=['a', 'b', 'c'])
print(df)

    Name  Age
a  Honey   20
b  Bunny   21
c  Sunny   22

### DataFrame for pandas merge

In [127]:
# inner join   - it displays which ever inner columns match(intersection)
# outer join   - it displays which ever outer columns match(union)
# left join    - left matching columns
# right join   - right matching columns

# Attributes

pd.merge(left, right, how='inner', on=None, left_on=None, right_on=None,
left_index=False, right_index=False, sort=True)

# Press shift+tab to know more about attributes and their description.

In [103]:
import pandas as pd
left = pd.DataFrame({
    'id' : [11,22,33,44,55],
    'Name' : ['Tim', 'Sim', 'Rim', 'Kim', 'Yim'],
    'Grade' : [3.5, 4.0, 5.0, 5.5,6.0]})
right = pd.DataFrame({
    'id' : [11,22,33,44,55],
    'Name' : ['Tom', 'Sim', 'Rom', 'Kom', 'Yom'],
    'Grade' : [3.1, 4.0, 5.3, 5.6,6.1]})
print(left, '\n')
print(right)

   id Name  Grade
0  11  Tim    3.5
1  22  Sim    4.0
2  33  Rim    5.0
3  44  Kim    5.5
4  55  Yim    6.0

   id Name  Grade
0  11  Tom    3.1
1  22  Sim    4.0
2  33  Rom    5.3
3  44  Kom    5.6
4  55  Yom    6.1

In [105]:
left_join=pd.merge(left, right, on='id', how='left')
print(left_join)

   id Name_x  Grade_x Name_y  Grade_y
0  11    Tim      3.5    Tom      3.1
1  22    Sim      4.0    Sim      4.0
2  33    Rim      5.0    Rom      5.3
3  44    Kim      5.5    Kom      5.6
4  55    Yim      6.0    Yom      6.1

In [107]:
right_join=pd.merge(left, right, on='id', how='right')
print(right_join)

   id Name_x  Grade_x Name_y  Grade_y
0  11    Tim      3.5    Tom      3.1
1  22    Sim      4.0    Sim      4.0
2  33    Rim      5.0    Rom      5.3
3  44    Kim      5.5    Kom      5.6
4  55    Yim      6.0    Yom      6.1

In [113]:
inner_join=pd.merge(left, right, on='Name', how='inner')
print(inner_join)

   id_x Name  Grade_x  id_y  Grade_y
0    22  Sim      4.0    22      4.0

In [121]:
outer_join=pd.merge(left, right, on='Name', how='outer')
print(outer_join)

   id_x Name  Grade_x  id_y  Grade_y
0  11.0  Tim      3.5   NaN      NaN
1  22.0  Sim      4.0  22.0      4.0
2  33.0  Rim      5.0   NaN      NaN
3  44.0  Kim      5.5   NaN      NaN
4  55.0  Yim      6.0   NaN      NaN
5   NaN  Tom      NaN  11.0      3.1
6   NaN  Rom      NaN  33.0      5.3
7   NaN  Kom      NaN  44.0      5.6
8   NaN  Yom      NaN  55.0      6.1

In [122]:
inner_join=pd.merge(left, right, on='Grade', how='inner')
print(inner_join)

   id_x Name_x  Grade  id_y Name_y
0    22    Sim    4.0    22    Sim

In [123]:
outer_join=pd.merge(left, right, on='Grade', how='outer')
print(outer_join)

   id_x Name_x  Grade  id_y Name_y
0  11.0    Tim    3.5   NaN    NaN
1  22.0    Sim    4.0  22.0    Sim
2  33.0    Rim    5.0   NaN    NaN
3  44.0    Kim    5.5   NaN    NaN
4  55.0    Yim    6.0   NaN    NaN
5   NaN    NaN    3.1  11.0    Tom
6   NaN    NaN    5.3  33.0    Rom
7   NaN    NaN    5.6  44.0    Kom
8   NaN    NaN    6.1  55.0    Yom

In [124]:
left_join=pd.merge(left, right, on='Grade', how='left')
print(left_join)

   id_x Name_x  Grade  id_y Name_y
0    11    Tim    3.5   NaN    NaN
1    22    Sim    4.0  22.0    Sim
2    33    Rim    5.0   NaN    NaN
3    44    Kim    5.5   NaN    NaN
4    55    Yim    6.0   NaN    NaN

In [125]:
right_join=pd.merge(left, right, on='Grade', how='right')
print(right_join)

   id_x Name_x  Grade  id_y Name_y
0  22.0    Sim    4.0    22    Sim
1   NaN    NaN    3.1    11    Tom
2   NaN    NaN    5.3    33    Rom
3   NaN    NaN    5.6    44    Kom
4   NaN    NaN    6.1    55    Yom

In [64]:
# Lets create two DataFrames to merge and join using Dictionary

df1=pd.DataFrame({'Batsmen':['Sachin', 'Virat', 'Yuvraj'], 'Bowler': ['Zaheer', 'Bumrah', 'Bhuvaneshwar'],
                  'Score':[100, 200, 300], 'Wicket': [10, 20, 30]})
df1

  Batsmen        Bowler  Score  Wicket
0  Sachin        Zaheer    100      10
1   Virat        Bumrah    200      20
2  Yuvraj  Bhuvaneshwar    300      30

In [82]:
df2=pd.DataFrame({'Batsmen':['Dhoni', 'Rahul', 'Yuvraj'], 'Bowler': ['Jadhav', 'Bumrah', 'Bhuvaneshwar'],
                  'Scores':[120, 20, 100], 'Wicket': [12, 22, 33]})
df2

  Batsmen        Bowler  Scores  Wicket
0   Dhoni        Jadhav     120      12
1   Rahul        Bumrah      20      22
2  Yuvraj  Bhuvaneshwar     100      33

In [83]:
pd.merge(df1,df2, on='Batsmen', how='inner')

  Batsmen      Bowler_x  Score  Wicket_x      Bowler_y  Scores  Wicket_y
0  Yuvraj  Bhuvaneshwar    300        30  Bhuvaneshwar     100        33

In [84]:
pd.merge(df1, df2, on='Batsmen', how='outer')  # It displays NaN when coulumns does not match

  Batsmen      Bowler_x  Score  Wicket_x      Bowler_y  Scores  Wicket_y
0  Sachin        Zaheer  100.0      10.0           NaN     NaN       NaN
1   Virat        Bumrah  200.0      20.0           NaN     NaN       NaN
2  Yuvraj  Bhuvaneshwar  300.0      30.0  Bhuvaneshwar   100.0      33.0
3   Dhoni           NaN    NaN       NaN        Jadhav   120.0      12.0
4   Rahul           NaN    NaN       NaN        Bumrah    20.0      22.0

In [85]:
pd.merge(df1, df2, on='Bowler', how='inner')

  Batsmen_x        Bowler  Score  Wicket_x Batsmen_y  Scores  Wicket_y
0     Virat        Bumrah    200        20     Rahul      20        22
1    Yuvraj  Bhuvaneshwar    300        30    Yuvraj     100        33

In [86]:
pd.merge(df1, df2, on='Bowler', how='outer')

  Batsmen_x        Bowler  Score  Wicket_x Batsmen_y  Scores  Wicket_y
0    Sachin        Zaheer  100.0      10.0       NaN     NaN       NaN
1     Virat        Bumrah  200.0      20.0     Rahul    20.0      22.0
2    Yuvraj  Bhuvaneshwar  300.0      30.0    Yuvraj   100.0      33.0
3       NaN        Jadhav    NaN       NaN     Dhoni   120.0      12.0

In [87]:
pd.merge(df1, df2, on='Bowler', how='left')

  Batsmen_x        Bowler  Score  Wicket_x Batsmen_y  Scores  Wicket_y
0    Sachin        Zaheer    100        10       NaN     NaN       NaN
1     Virat        Bumrah    200        20     Rahul    20.0      22.0
2    Yuvraj  Bhuvaneshwar    300        30    Yuvraj   100.0      33.0

In [88]:
pd.merge(df1, df2, on='Bowler', how='right')

  Batsmen_x        Bowler  Score  Wicket_x Batsmen_y  Scores  Wicket_y
0     Virat        Bumrah  200.0      20.0     Rahul      20        22
1    Yuvraj  Bhuvaneshwar  300.0      30.0    Yuvraj     100        33
2       NaN        Jadhav    NaN       NaN     Dhoni     120        12

In [93]:
pd.merge(df1,df2, on='Wicket', how='left')

  Batsmen_x      Bowler_x  Score  Wicket Batsmen_y Bowler_y  Scores
0    Sachin        Zaheer    100      10       NaN      NaN     NaN
1     Virat        Bumrah    200      20       NaN      NaN     NaN
2    Yuvraj  Bhuvaneshwar    300      30       NaN      NaN     NaN

In [94]:
pd.merge(df1,df2, on='Wicket', how='right')

  Batsmen_x Bowler_x  Score  Wicket Batsmen_y      Bowler_y  Scores
0       NaN      NaN    NaN      12     Dhoni        Jadhav     120
1       NaN      NaN    NaN      22     Rahul        Bumrah      20
2       NaN      NaN    NaN      33    Yuvraj  Bhuvaneshwar     100

In [96]:
pd.merge(df1,df2, on=['Wicket', 'Bowler'], how='left')

  Batsmen_x        Bowler  Score  Wicket Batsmen_y  Scores
0    Sachin        Zaheer    100      10       NaN     NaN
1     Virat        Bumrah    200      20       NaN     NaN
2    Yuvraj  Bhuvaneshwar    300      30       NaN     NaN

In [98]:
pd.merge(df1,df2, on=['Wicket', 'Bowler'], how='outer')

  Batsmen_x        Bowler  Score  Wicket Batsmen_y  Scores
0    Sachin        Zaheer  100.0      10       NaN     NaN
1     Virat        Bumrah  200.0      20       NaN     NaN
2    Yuvraj  Bhuvaneshwar  300.0      30       NaN     NaN
3       NaN        Jadhav    NaN      12     Dhoni   120.0
4       NaN        Bumrah    NaN      22     Rahul    20.0
5       NaN  Bhuvaneshwar    NaN      33    Yuvraj   100.0

## Concatenation

Pandas provides various ways to combine Series, and DataFrames easily.

# Attributes

pd.concat(objs,axis=0,join='outer',join_axes=None,ignore_index=False)

# Press shift+tab to know about attributes and their description.

In [135]:
import pandas as pd
score_card1 = pd.DataFrame({
    'Name':['John', 'Johnson', 'Johny', 'Jockey'],
    'subject':['English', 'Physics', 'Chemistry', 'Maths'],
    'Marks' : [87, 90, 91, 93]
                           })
score_card2= pd.DataFrame({
    'Name' : ['David', 'Dravid', 'Adam', 'Bairstow'],
    'subject': ['English', 'Chemistry', 'Science', 'Spanish'],
    'Marks': [93,85,96,99]
})
print(score_card1, '\n')
print(score_card2, '\n')
concat= pd.concat([score_card1, score_card2])
concat

      Name    subject  Marks
0     John    English     87
1  Johnson    Physics     90
2    Johny  Chemistry     91
3   Jockey      Maths     93

       Name    subject  Marks
0     David    English     93
1    Dravid  Chemistry     85
2      Adam    Science     96
3  Bairstow    Spanish     99

       Name    subject  Marks
0      John    English     87
1   Johnson    Physics     90
2     Johny  Chemistry     91
3    Jockey      Maths     93
0     David    English     93
1    Dravid  Chemistry     85
2      Adam    Science     96
3  Bairstow    Spanish     99

In [136]:
pd.concat([score_card1, score_card2],axis=1)

      Name    subject  Marks      Name    subject  Marks
0     John    English     87     David    English     93
1  Johnson    Physics     90    Dravid  Chemistry     85
2    Johny  Chemistry     91      Adam    Science     96
3   Jockey      Maths     93  Bairstow    Spanish     99

## Time series

Pandas also provide Time series data for Time series analysis, stocks, and sensex
Generally, we come accross

- Converting time series to different frequencies.
- Generating Time sequence.

#### datatime.now() : it displays current data and time

In [138]:
import pandas as pd
print(pd.datetime.now())

2020-10-11 13:57:35.716434

<ipython-input-138-9df5e273d28e>:2: FutureWarning: The pandas.datetime class is deprecated and will be removed from pandas in a future version. Import from datetime module instead.
  print(pd.datetime.now())

Timestamp - it means using the points in time. Letâ€™s take an example âˆ’
Associates value with points

In [140]:
pd.Timestamp('2020-10-11')

Timestamp('2020-10-11 00:00:00')

In [146]:
pd.date_range("11:00", "12:30", freq="30min").time     # jus like range function

array([datetime.time(11, 0), datetime.time(11, 30), datetime.time(12, 0),
       datetime.time(12, 30)], dtype=object)

In [147]:
pd.date_range('10:00', '12:30', freq='H').time

array([datetime.time(10, 0), datetime.time(11, 0), datetime.time(12, 0)],
      dtype=object)

In [150]:
pd.to_datetime(pd.Series(['Oct 20, 2020','2020-01-10', None]))

0   2020-10-20
1   2020-01-10
2          NaT
dtype: datetime64[ns]

In [151]:
# NaT is just like NaN
# NaT - Not a Time

In [153]:
pd.date_range('10/11/2020', periods=5)  # period displays no of days jus like frequency

DatetimeIndex(['2020-10-11', '2020-10-12', '2020-10-13', '2020-10-14',
               '2020-10-15'],
              dtype='datetime64[ns]', freq='D')